megalloid/STM32F0xx/Drivers/MY/Src/my_stm32f0xx_rcc.c
/**
 * @author  Andrey Zaostrovnykh
 * @email   megalloid@mail.ru
 * @link    http://smarthouseautomatics.ru/stm32/stm32f0xx/rcc/
 * @version v0.1
 * @ide     STM32CubeIDE
 * @brief   Библиотека RCC для STM32F0xx
 */

#include "my_stm32f0xx_rcc.h"

extern uint32_t SystemCoreClock;

MY_Result_t MY_RCC_System_Init(void)
{
	/* Структуры для настроек */
	MY_RCC_Clock_Init_t  RCC_Clock_InitStruct;
	MY_RCC_Osc_Init_t 	 RCC_Osc_InitStruct;

	/* Устанавливаем из настроек источник тактирования */
	RCC_Osc_InitStruct.OscillatorType = RCC_OSCILLATORTYPE;

	/* Устанавливаем параметры осциллятора HSE или HSI*/
	if(RCC_Osc_InitStruct.OscillatorType == RCC_OSCILLATORTYPE_HSE)
	{
		RCC_Osc_InitStruct.HSE_State = RCC_HSE_ON;
		RCC_Osc_InitStruct.HSI_State = RCC_HSI_OFF;
		RCC_Osc_InitStruct.PLL.PLL_State = RCC_PLL_NONE;
	}
	else if(RCC_Osc_InitStruct.OscillatorType == RCC_OSCILLATORTYPE_HSI)
	{
		RCC_Osc_InitStruct.HSE_State = RCC_HSE_OFF;
		RCC_Osc_InitStruct.HSI_State = RCC_HSI_ON;
		RCC_Osc_InitStruct.PLL.PLL_State = RCC_PLL_NONE;
		RCC_Osc_InitStruct.HSI_CalibrationValue = RCC_HSICALIBRATION_VALUE;
	}

	/* Если используется PLL в качестве источника тактового сигнала для SYSCLK */
	if(RCC_SYSCLK_SOURCE == RCC_SYSCLK_SOURCE_PLL)
	{
		RCC_Osc_InitStruct.PLL.PLL_Source = RCC_PLLSOURCE;
		RCC_Osc_InitStruct.PLL.PLL_PREDIV = RCC_PLL_PREDIV;
		RCC_Osc_InitStruct.PLL.PLL_MUL = RCC_PLL_MUL;
		RCC_Osc_InitStruct.PLL.PLL_State = RCC_PLL_ON;
	}

	/* Сбрасываем настройки тактирования к дефолту */
	MY_RCC_System_DeInit();

	/* Производим настройку осциллятора */
	if(MY_RCC_Osc_Config(&RCC_Osc_InitStruct)!= MY_Result_Ok)
	{
		return MY_Result_Error;
	}

	/* Настраиваем инициализируемые шины CPU, AHB и APB*/
	RCC_Clock_InitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1);
	RCC_Clock_InitStruct.SYSCLK_Source = RCC_SYSCLK_SOURCE;
	RCC_Clock_InitStruct.AHBCLK_Divider = RCC_AHB_DIV;
	RCC_Clock_InitStruct.APB1CLK_Divider = RCC_APB1_DIV;

	/* Инициализируем тактирование шин CPU, AHB и APB */
	if(MY_RCC_Clock_Config(&RCC_Clock_InitStruct, FLASH_LATENCY) != MY_Result_Ok)
	{
		return MY_Result_Error;
	}

	return MY_Result_Ok;

}


void MY_RCC_System_DeInit(void)
{
	/* Устанавливаем бит HSION, HSITRIM[4:0] к значениям устанавливаемым при сбросе */
	SET_BIT(RCC->CR, RCC_CR_HSION | RCC_CR_HSITRIM_4);

	/* Сбрасываем биты SW[1:0], HPRE[3:0], PPRE[2:0] и MCOSEL[2:0] */
	CLEAR_BIT(RCC->CFGR, RCC_CFGR_SW | RCC_CFGR_HPRE | RCC_CFGR_PPRE | RCC_CFGR_MCO);

	/* Сбрасываем биты HSEON, CSSON, PLLON */
	CLEAR_BIT(RCC->CR, RCC_CR_PLLON | RCC_CR_CSSON | RCC_CR_HSEON);

	/* Сбрасываем бит HSEBYP */
	CLEAR_BIT(RCC->CR, RCC_CR_HSEBYP);

	/* Сбрасываем регистр CFGR */
	CLEAR_REG(RCC->CFGR);

	/* Сбрасываем регистр CFGR2 */
	CLEAR_REG(RCC->CFGR2);

	/* Сбрасываем регистр CFGR3 */
	CLEAR_REG(RCC->CFGR3);

	/* Отключаем все прерывания */
	CLEAR_REG(RCC->CIR);

	/* Обновление глобальной переменной SystemCoreClock */
	SystemCoreClock = HSI_VALUE;
}


MY_Result_t	MY_RCC_Osc_Config(MY_RCC_Osc_Init_t *RCC_Osc_InitStruct)
{
	/* Переменная используемая для отсчёта таймаутов */
	uint32_t tickstart = 0U;

	/*------------------------------- Настройка HSE -------------------------------*/
	/* Если для настройки выбран осциллятор HSE */
	if(((RCC_Osc_InitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE)
	{
		/* Когда HSE используется в качестве системного источника тактирования или источником тактового сигнала для PLL когда он используется в качестве основного осциллятора */
		if((MY_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_HSE) || \
		  ((MY_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && (MY_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSE)))
		{
			/* Если он используется и до этого не был включен */
			if((MY_RCC_GET_FLAG(RCC_FLAG_HSERDY) != RESET) && (RCC_Osc_InitStruct->HSE_State == RCC_HSE_OFF))
			{
				return MY_Result_Error;
			}
		}
		else
		{
			/* Устанавливаем новое состояние для HSE */
			MY_RCC_HSE_CONFIG(RCC_Osc_InitStruct->HSE_State);

			/* Проверяем состояние HSE в структуре */
			if(RCC_Osc_InitStruct->HSE_State != RCC_HSE_OFF)
			{
				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

				/* Ждём пока RCC взведёт флаг HSE ready */
				while(MY_RCC_GET_FLAG(RCC_FLAG_HSERDY) == RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
			else
			{
				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

				/* Ждём пока RCC снимет флаг HSE ready */
				while(MY_RCC_GET_FLAG(RCC_FLAG_HSERDY) != RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
		}
	}

	/*----------------------------- Настройка HSI -----------------------------*/
	/* Если для настройки выбран внутренний осциллятор HSI */
	if(((RCC_Osc_InitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI)
	{
		/* Когда HSI используется в качестве системного источника тактирования или источником тактового сигнала для PLL когда он используется в качестве основного осциллятора */
		if((MY_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_HSI) ||
		  ((MY_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && (MY_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSI)))
		{
			/* В этом случае запрещено его выключать и дальнейшая настройка не возможна */
			if((MY_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != RESET) && (RCC_Osc_InitStruct->HSI_State != RCC_HSI_ON))
			{
				return MY_Result_Error;
			}
			/* Иначе доступна только калибровка */
			else
			{
				/* Подстраиваем значение калибровки High Speed oscillator (HSI) */
				MY_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_Osc_InitStruct->HSI_CalibrationValue);
			}
		}
		else
		{
			/* Проверяем состояние HSI в структуре */
			if(RCC_Osc_InitStruct->HSI_State != RCC_HSI_OFF)
			{
				/* Включаем внутренний High Speed oscillator (HSI) */
				MY_RCC_HSI_ENABLE();

				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

				/* Ждём пока RCC не взведёт флаг готовности HSI */
				while(MY_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart ) > HSI_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}

				/* Подстраиваем значение калибровки High Speed oscillator (HSI) */
				MY_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_Osc_InitStruct->HSI_CalibrationValue);
			}
			else
			{
				/* Отключаем High Speed oscillator (HSI) */
				MY_RCC_HSI_DISABLE();

				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

