megalloid/STM32F0xx/Drivers/MY/Src/my_stm32f0xx_rcc.c
				/* Ждём пока RCC не снимет флаг готовности HSI */
				while(MY_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart ) > HSI_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
		}
	}


	/*------------------------------ Конфигурация LSI ------------------------------*/
	/* Если для настройки выбран осциллятор LSI */
	if(((RCC_Osc_InitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI)
	{
		/* Проверяем текущее состояние LSI в настройках */
		if(RCC_Osc_InitStruct->LSI_State != RCC_LSI_OFF)
		{
			/* Включаем встроенный Low Speed oscillator (LSI) */
			MY_RCC_LSI_ENABLE();

			/* Помещаем значение для отчёта таймаута */
			tickstart = MY_SysTick_GetTick();

			/* Ждём пока RCC не взведёт флаг готовности LSI */
			while(MY_RCC_GET_FLAG(RCC_FLAG_LSIRDY) == RESET)
			{
				/* Если истёк таймаут - выходим с ошибкой */
				if((MY_SysTick_GetTick() - tickstart ) > LSI_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}
		else
		{
			/* Отключаем встроенный Low Speed oscillator (LSI) */
			MY_RCC_LSI_DISABLE();

			/* Помещаем значение для отчёта таймаута */
			tickstart = MY_SysTick_GetTick();

			/* Ждём пока RCC не снимет флаг готовности LSI */
			while(MY_RCC_GET_FLAG(RCC_FLAG_LSIRDY) != RESET)
			{
				/* Если истёк таймаут - выходим с ошибкой */
				if((MY_SysTick_GetTick() - tickstart ) > LSI_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}
	}


	/*------------------------------ Конфигурация LSE ------------------------------*/
	/* Если для настройки выбран осциллятор LSE */
	if(((RCC_Osc_InitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE)
	{
		/* Статус сброса по питанию */
		FlagStatus pwrclkchanged = RESET;

		/* Обновляем конфигурацию LSE в регистре Backup Domain control */
		/* Это необходимо для включения доступа на запись в Backup Domain */
		if(MY_RCC_PWR_IS_CLK_DISABLED())
		{
			MY_RCC_PWR_CLK_ENABLE();
			pwrclkchanged = SET;
		}

		/* Если бит Disable Backup Domain write protection сброшен*/
		if(IS_BIT_CLR(PWR->CR, PWR_CR_DBP))
		{
			/* Разрешаем запись в Backup domain */
			SET_BIT(PWR->CR, PWR_CR_DBP);

			/* Помещаем значение для отчёта таймаута */
			tickstart = MY_SysTick_GetTick();

			/* Ждём когда защита от записи в Backup domain будет снята */
			while((((PWR->CR) & (PWR_CR_DBP)) == RESET))
			{
				/* Если истёк таймаут - выходим с ошибкой */
				if((MY_SysTick_GetTick() - tickstart) > RCC_DBP_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}

		/* Устанавливаем новое состояние LSE */
		MY_RCC_LSE_CONFIG(RCC_Osc_InitStruct->LSE_State);

		/* Проверяем новое состояние LSE */
		if(RCC_Osc_InitStruct->LSE_State != RCC_LSE_OFF)
		{
			/* Помещаем значение для отчёта таймаута */
			tickstart = MY_SysTick_GetTick();

			/* Ждём когда не будет взведен флаг готовности LSE */
			while(MY_RCC_GET_FLAG(RCC_FLAG_LSERDY) == RESET)
			{
				/* Если истёк таймаут - выходим с ошибкой */
				if((MY_SysTick_GetTick() - tickstart ) > RCC_LSE_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}
		else
		{
			/* Помещаем значение для отчёта таймаута */
			tickstart = MY_SysTick_GetTick();

			/* Ждём когда не будет взведен флаг готовности LSE */
			while(MY_RCC_GET_FLAG(RCC_FLAG_LSERDY) != RESET)
			{
				/* Если истёк таймаут - выходим с ошибкой */
				if((MY_SysTick_GetTick() - tickstart ) > RCC_LSE_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}

		/* Требуется отключить тактирование power clock */
		if(pwrclkchanged == SET)
		{
			MY_RCC_PWR_CLK_DISABLE();
		}
	}


	/*----------------------------- Настройка HSI14 -----------------------------*/
	/* Если для настройки выбран осциллятор HSI14 */
	if(((RCC_Osc_InitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI14) == RCC_OSCILLATORTYPE_HSI14)
	{
		/* Проверка текущего состояния HSI14 в настройках */
		if(RCC_Osc_InitStruct->HSI14_State == RCC_HSI14_ON)
		{
			/* Отключаем ADC control для HSI14 */
			MY_RCC_HSI14ADC_DISABLE();

			/* Включаем HSI14 */
			MY_RCC_HSI14_ENABLE();

			/* Помещаем значение для отчёта таймаута */
			tickstart = MY_SysTick_GetTick();

			/* Ждём когда не будет взведен флаг готовности HSI14 */
			while(MY_RCC_GET_FLAG(RCC_FLAG_HSI14RDY) == RESET)
			{
				/* Если истёк таймаут - выходим с ошибкой */
				if((MY_SysTick_GetTick() - tickstart) > HSI14_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}

			/* Подстраиваем калибровочное значение для Internal High Speed oscillator 14Mhz (HSI14) */
			MY_RCC_HSI14_CALIBRATIONVALUE_ADJUST(RCC_Osc_InitStruct->HSI14_CalibrationValue);
		}
		else if(RCC_Osc_InitStruct->HSI14_State == RCC_HSI14_ADC_CONTROL)
		{
			/* Включаем ADC для Internal High Speed oscillator HSI14 */
			MY_RCC_HSI14ADC_ENABLE();

			/* Подстраиваем калибровочное значение для Internal High Speed oscillator 14Mhz (HSI14) */
			MY_RCC_HSI14_CALIBRATIONVALUE_ADJUST(RCC_Osc_InitStruct->HSI14_CalibrationValue);
		}
		else
		{
			/* Отключаем ADC control для HSI14 */
			MY_RCC_HSI14ADC_DISABLE();

			/* Отключаем HSI14 */
			MY_RCC_HSI14_DISABLE();

			/* Помещаем значение для отчёта таймаута */
			tickstart = MY_SysTick_GetTick();

			/* Ждём когда не будет снят флаг готовности HSI14 */
			while(MY_RCC_GET_FLAG(RCC_FLAG_HSI14RDY) != RESET)
			{
				/* Если истёк таймаут - выходим с ошибкой */
				if((MY_SysTick_GetTick() - tickstart) > HSI14_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}
	}

	#if defined(RCC_HSI48_SUPPORT)

	/*----------------------------- Настройка HSI48 -----------------------------*/
	/* Если необходимо настроить HSI48 */
	if(((RCC_Osc_InitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI48) == RCC_OSCILLATORTYPE_HSI48)
	{
		/* Когда используется HSI48 в качестве источника системного тактирования он не может быть отключен */
		if((MY_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_HSI48) ||
		  ((MY_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && (MY_RCC_GET_PLL_OSCSOURCE() == RCC_PLLSOURCE_HSI48)))
		{
			/* Если флаг готовности взведен но не включен в настройках структуры - возвращаем ошибку */
			if((MY_RCC_GET_FLAG(RCC_FLAG_HSI48RDY) != RESET) && (RCC_Osc_InitStruct->HSI48_State != RCC_HSI48_ON))
			{
				return MY_Result_Error;
			}
		}
		else
		{
			/* Проверяем состояние HSI48 в настройках структуры */
			if(RCC_Osc_InitStruct->HSI48_State != RCC_HSI48_OFF)
			{
				/* Включаем HSI48 */
				MY_RCC_HSI48_ENABLE();

				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

				/* Ждём когда не будет взведен флаг готовности HSI48 */
				while(MY_RCC_GET_FLAG(RCC_FLAG_HSI48RDY) == RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart) > HSI48_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
			else
			{
				/* Отключаем HSI48 */
				MY_RCC_HSI48_DISABLE();

				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

