megalloid/STM32F0xx/Drivers/MY/Src/my_stm32f0xx_rcc.c
				/* Ждём когда не будет снят флаг готовности HSI48 */
				while(MY_RCC_GET_FLAG(RCC_FLAG_HSI48RDY) != RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart) > HSI48_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
		}
	}
	#endif

	/*-------------------------------- Настройка PLL --------------------------------*/
	/* Если в качестве настраиваемого осциллятора выбран PLL */
	if ((RCC_Osc_InitStruct->PLL.PLL_State) != RCC_PLL_NONE)
	{
		/* Проверяем, является ли PLL источником системного тактирования или нет*/
		if(MY_RCC_GET_SYSCLK_SOURCE() != RCC_SYSCLKSOURCE_STATUS_PLLCLK)
		{
			/* Если в структуре PLL запущен */
			if((RCC_Osc_InitStruct->PLL.PLL_State) == RCC_PLL_ON)
			{
				/* Сначана отключаем PLL */
				MY_RCC_PLL_DISABLE();

				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

				/* Ждём когда не будет снят флаг готовности PLL */
				while(MY_RCC_GET_FLAG(RCC_FLAG_PLLRDY)  != RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}

				/* Настраиваем тактирование PLL, предделитель и умножитель */
				MY_RCC_PLL_CONFIG(RCC_Osc_InitStruct->PLL.PLL_Source, RCC_Osc_InitStruct->PLL.PLL_PREDIV, RCC_Osc_InitStruct->PLL.PLL_MUL);

				/* Включаем PLL обратно */
				MY_RCC_PLL_ENABLE();

				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

				/* Ждём когда не будет взведен флаг готовности PLL */
				while(MY_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
			else
			{
				/* Отключаем PLL */
				MY_RCC_PLL_DISABLE();

				/* Помещаем значение для отчёта таймаута */
				tickstart = MY_SysTick_GetTick();

				/* Ждём когда не будет снят флаг готовности PLL */
				while(MY_RCC_GET_FLAG(RCC_FLAG_PLLRDY)  != RESET)
				{
					/* Если истёк таймаут - выходим с ошибкой */
					if((MY_SysTick_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
		}
		else
		{
			return MY_Result_Error;
		}
	}

	return MY_Result_Ok;
}


MY_Result_t MY_RCC_Clock_Config(MY_RCC_Clock_Init_t *RCC_Clock_InitStruct, uint32_t FlashLatency)
{
	/* Переменная используемая для отсчёта таймаутов */
	uint32_t tickstart = 0U;

	/* Для корректного чтения данных с FLASH памяти, число периодов ожидания (LATENCY)
	   должно быть корректно установлено в соответствии с частотой CPU (HCLK) на используемом МК.
	   Увеличивается количество периодов ожидания при использовании высокой частоты CPU (от 24MHz) */
	if(FLASH_LATENCY > (FLASH->ACR & FLASH_ACR_LATENCY))
	{
		/* Записываем новое количество периодов ожидания в бит LATENCY в регистре FLASH_ACR */
		FLASH->ACR = (FLASH->ACR&(~FLASH_ACR_LATENCY)) | (FlashLatency);

		/* Проверяем установилось ли значение в поле LATENCY в регистре FLASH_ACR */
		if((FLASH->ACR & FLASH_ACR_LATENCY) != FLASH_LATENCY)
		{
			return MY_Result_Error;
		}
	}


	/*-------------------------- Настройка HCLK --------------------------*/
	if(((RCC_Clock_InitStruct->ClockType) & RCC_CLOCKTYPE_HCLK) == RCC_CLOCKTYPE_HCLK)
	{
		MODIFY_REG(RCC->CFGR, RCC_CFGR_HPRE, RCC_Clock_InitStruct->AHBCLK_Divider);
	}


	/*------------------------- Настройка SYSCLK ---------------------------*/
	if(((RCC_Clock_InitStruct->ClockType) & RCC_CLOCKTYPE_SYSCLK) == RCC_CLOCKTYPE_SYSCLK)
	{
		/* Если HSE выбран как System Clock Source */
		if(RCC_Clock_InitStruct->SYSCLK_Source == RCC_SYSCLK_SOURCE_HSE)
		{
			/* Проверяем установлен ли флаг HSE ready */
			if(MY_RCC_GET_FLAG(RCC_FLAG_HSERDY) == RESET)
			{
				return MY_Result_Error;
			}
		}
		/* Если PLL выбран как System Clock Source */
		else if(RCC_Clock_InitStruct->SYSCLK_Source == RCC_SYSCLK_SOURCE_PLL)
		{
			/* Проверяем установлен ли флаг PLL ready */
			if(MY_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == RESET)
			{
				return MY_Result_Error;
			}
		}

		/* Если в системе есть HSI48 */
		#if defined(RCC_CFGR_SWS_HSI48)

			/* Если HSI48 выбран как System Clock Source */
		else if(RCC_Clock_InitStruct->SYSCLK_Source == RCC_SYSCLKSOURCE_HSI48)
		{
			/* Проверяем установлен ли HSI48 ready */
			if(MY_RCC_GET_FLAG(RCC_FLAG_HSI48RDY) == RESET)
			{
				return MY_Result_Error;
			}
		}

		#endif

		/* Если HSI выбран как System Clock Source */
		else
		{
			/* Проверяем установлен ли HSI ready */
			if(MY_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == RESET)
			{
				return MY_Result_Error;
			}
		}

		/* Устанавливаем выбранный источник System Clock Source */
		MY_RCC_SYSCLK_CONFIG(RCC_Clock_InitStruct->SYSCLK_Source);


		/* Получаем значение для вычисления таймаута на выполнение */
		tickstart = MY_SysTick_GetTick();

		/* Проверяем, установилось ли значение в регистре */
		if(RCC_Clock_InitStruct->SYSCLK_Source == RCC_SYSCLK_SOURCE_HSE)
		{
			while (MY_RCC_GET_SYSCLK_SOURCE() != RCC_SYSCLKSOURCE_STATUS_HSE)
			{
				if((MY_SysTick_GetTick() - tickstart ) > (5000U))
				{
					return MY_Result_Timeout;
				}
			}
		}
		else if(RCC_Clock_InitStruct->SYSCLK_Source == RCC_SYSCLK_SOURCE_PLL)
		{
			while (MY_RCC_GET_SYSCLK_SOURCE() != RCC_SYSCLKSOURCE_STATUS_PLLCLK)
			{
				if((MY_SysTick_GetTick() - tickstart ) > (5000U))
				{
					return MY_Result_Timeout;
				}
			}
		}

		#if defined(RCC_CFGR_SWS_HSI48)

		else if(RCC_Clock_InitStruct->SYSCLK_Source == RCC_SYSCLKSOURCE_HSI48)
		{
			while (MY_RCC_GET_SYSCLK_SOURCE() != RCC_SYSCLKSOURCE_STATUS_HSI48)
			{
				if((MY_SysTick_GetTick() - tickstart) > CLOCKSWITCH_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}

		#endif

		else
		{
			while (MY_RCC_GET_SYSCLK_SOURCE() != RCC_SYSCLKSOURCE_STATUS_HSI)
			{
				if((MY_SysTick_GetTick() - tickstart ) > (5000U))
				{
					return MY_Result_Timeout;
				}
			}
		}
	}

	/* Если используется частота <24МГц - записываем значение предвыборки */
	if(FLASH_LATENCY < (FLASH->ACR & FLASH_ACR_LATENCY))
	{
		/* Записываем новое значение LATENCY в регистр FLASH_ACR */
		FLASH->ACR = (FLASH->ACR&(~FLASH_ACR_LATENCY)) | (FLASH_LATENCY);

