megalloid/STM32F0xx/Drivers/MY/Src/my_stm32f0xx_rcc.c
		/* Проверяем установилось ли значение в регистре */
		if((FLASH->ACR & FLASH_ACR_LATENCY) != FLASH_LATENCY)
		{
			return MY_Result_Error;
		}
	}


	/*-------------------------- Настройка PCLK1  ---------------------------*/
	if(((RCC_Clock_InitStruct->ClockType) & RCC_CLOCKTYPE_PCLK1) == RCC_CLOCKTYPE_PCLK1)
	{
		MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE, RCC_Clock_InitStruct->APB1CLK_Divider);
	}

	/* Обновляем значение глобальной переменной SystemCoreClock */
	SystemCoreClock = MY_RCC_SysClock_GetFreq() >> AHBPrescTable[(RCC->CFGR & RCC_CFGR_HPRE)>> RCC_CFGR_HPRE_BITNUMBER];

	/* Устанавливаем значение для SysTick таймера, чтобы получить ровно 1 мс. */
	MY_SysTick_Init(SystemCoreClock/1000U, 0U);

	return MY_Result_Ok;

}


MY_Result_t MY_RCC_PeriphClock_Config(MY_RCC_PeriphClock_Init_t *RCC_PeriphClock_InitStruct)
{
	uint32_t tickstart = 0U;
	uint32_t temp_reg = 0U;

	/*---------------------------- Настройка RTC -------------------------------*/
	if(((RCC_PeriphClock_InitStruct->PeriphClockSelection) & RCC_PERIPHCLK_RTC) == (RCC_PERIPHCLK_RTC))
	{
		FlagStatus pwrclkchanged = RESET;

		/* As soon as function is called to change RTC clock source, activation of the power domain is done. */
		/* Requires to enable write access to Backup Domain of necessary */
		if(MY_RCC_PWR_IS_CLK_DISABLED())
		{
			MY_RCC_PWR_CLK_ENABLE();
			pwrclkchanged = SET;
		}

		if(IS_BIT_CLR(PWR->CR, PWR_CR_DBP))
		{
			/* Enable write access to Backup domain */
			SET_BIT(PWR->CR, PWR_CR_DBP);

			/* Wait for Backup domain Write protection disable */
			tickstart = MY_SysTick_GetTick();

			while(IS_BIT_CLR(PWR->CR, PWR_CR_DBP))
			{
				if((MY_SysTick_GetTick() - tickstart) > RCC_DBP_TIMEOUT_VALUE)
				{
					return MY_Result_Timeout;
				}
			}
		}

		/* Reset the Backup domain only if the RTC Clock source selection is modified from reset value */
		temp_reg = (RCC->BDCR & RCC_BDCR_RTCSEL);

		if((temp_reg != 0x00000000U) && (temp_reg != (RCC_PeriphClock_InitStruct->RTC_ClockSelection & RCC_BDCR_RTCSEL)))
		{
			/* Store the content of BDCR register before the reset of Backup Domain */
			temp_reg = (RCC->BDCR & ~(RCC_BDCR_RTCSEL));

			/* RTC Clock selection can be changed only if the Backup Domain is reset */
			MY_RCC_BACKUPRESET_FORCE();
			MY_RCC_BACKUPRESET_RELEASE();

			/* Restore the Content of BDCR register */
			RCC->BDCR = temp_reg;

			/* Wait for LSERDY if LSE was enabled */
			if (IS_BIT_SET(temp_reg, RCC_BDCR_LSEON))
			{
				/* Get Start Tick */
				tickstart = MY_SysTick_GetTick();

				/* Wait till LSE is ready */
				while(MY_RCC_GET_FLAG(RCC_FLAG_LSERDY) == RESET)
				{
					if((MY_SysTick_GetTick() - tickstart) > RCC_LSE_TIMEOUT_VALUE)
					{
						return MY_Result_Timeout;
					}
				}
			}
		}

		MY_RCC_RTC_CONFIG(RCC_PeriphClock_InitStruct->RTC_ClockSelection);

		/* Require to disable power clock if necessary */
		if(pwrclkchanged == SET)
		{
			MY_RCC_PWR_CLK_DISABLE();
		}
	}

	/*------------------------------- USART1 Configuration ------------------------*/
	if(((RCC_PeriphClock_InitStruct->PeriphClockSelection) & RCC_PERIPHCLK_USART1) == RCC_PERIPHCLK_USART1)
	{
		/* Configure the USART1 clock source */
		MY_RCC_USART1_CONFIG(RCC_PeriphClock_InitStruct->USART1_ClockSelection);
	}


	#if defined(STM32F071xB) || \
		defined(STM32F072xB) || \
		defined(STM32F078xx) || \
		defined(STM32F091xC) || \
		defined(STM32F098xx)

	/*----------------------------- USART2 Configuration --------------------------*/
	if(((RCC_PeriphClock_InitStruct->PeriphClockSelection) & RCC_PERIPHCLK_USART2) == RCC_PERIPHCLK_USART2)
	{
		/* Configure the USART2 clock source */
		MY_RCC_USART2_CONFIG(RCC_PeriphClock_InitStruct->USART2_ClockSelection);
	}

	#endif


	#if defined(STM32F091xC) || \
		defined(STM32F098xx)

	/*----------------------------- USART3 Configuration --------------------------*/
	if(((RCC_PeriphClock_InitStruct->PeriphClockSelection) & RCC_PERIPHCLK_USART3) == RCC_PERIPHCLK_USART3)
	{
		/* Configure the USART3 clock source */
		MY_RCC_USART3_CONFIG(RCC_PeriphClock_InitStruct->USART3_ClockSelection);
	}

	#endif


	/*------------------------------ I2C1 Configuration ------------------------*/
	if(((RCC_PeriphClock_InitStruct->PeriphClockSelection) & RCC_PERIPHCLK_I2C1) == RCC_PERIPHCLK_I2C1)
	{
		/* Configure the I2C1 clock source */
		MY_RCC_I2C1_CONFIG(RCC_PeriphClock_InitStruct->I2C1_ClockSelection);
	}


	#if defined(STM32F042x6) || \
		defined(STM32F048xx) || \
		defined(STM32F072xB) || \
		defined(STM32F078xx) || \
		defined(STM32F070xB) || \
		defined(STM32F070x6)

	/*------------------------------ USB Configuration ------------------------*/
	if(((RCC_PeriphClock_InitStruct->PeriphClockSelection) & RCC_PERIPHCLK_USB) == RCC_PERIPHCLK_USB)
	{
		/* Configure the USB clock source */
		MY_RCC_USB_CONFIG(RCC_PeriphClock_InitStruct->USB_ClockSelection);
	}

	#endif


	#if defined(STM32F042x6) || \
		defined(STM32F048xx) || \
		defined(STM32F051x8) || \
		defined(STM32F058xx) || \
		defined(STM32F071xB) || \
		defined(STM32F072xB) || \
		defined(STM32F078xx) || \
		defined(STM32F091xC) || \
		defined(STM32F098xx)

	/*------------------------------ CEC clock Configuration -------------------*/
	if(((RCC_PeriphClock_InitStruct->PeriphClockSelection) & RCC_PERIPHCLK_CEC) == RCC_PERIPHCLK_CEC)
	{
		/* Configure the CEC clock source */
		MY_RCC_CEC_CONFIG(RCC_PeriphClock_InitStruct->CEC_ClockSelection);
	}

	#endif

	return MY_Result_Ok;
}


void MY_RCC_PeriphClock_GetConfig(MY_RCC_PeriphClock_Init_t *RCC_PeriphClock_InitStruct)
{
	/* Set all possible values for the extended clock type parameter------------*/
	/* Common part first */
	RCC_PeriphClock_InitStruct->PeriphClockSelection = RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_I2C1   | RCC_PERIPHCLK_RTC;

	/* Get the RTC configuration --------------------------------------------*/
	RCC_PeriphClock_InitStruct->RTC_ClockSelection = MY_RCC_GET_RTC_SOURCE();

	/* Get the USART1 clock configuration --------------------------------------------*/
	RCC_PeriphClock_InitStruct->USART1_ClockSelection = MY_RCC_GET_USART1_SOURCE();

	/* Get the I2C1 clock source -----------------------------------------------*/
	RCC_PeriphClock_InitStruct->I2C1_ClockSelection = MY_RCC_GET_I2C1_SOURCE();


	#if defined(STM32F071xB) || \
		defined(STM32F072xB) || \
		defined(STM32F078xx) || \
		defined(STM32F091xC) || \
		defined(STM32F098xx)

		RCC_PeriphClock_InitStruct->PeriphClockSelection |= RCC_PERIPHCLK_USART2;

		/* Get the USART2 clock source ---------------------------------------------*/
		RCC_PeriphClock_InitStruct->USART2_ClockSelection = MY_RCC_GET_USART2_SOURCE();

	#endif


	#if defined(STM32F091xC) || \
		defined(STM32F098xx)

		RCC_PeriphClock_InitStruct->PeriphClockSelection |= RCC_PERIPHCLK_USART3;

		/* Get the USART3 clock source ---------------------------------------------*/
		RCC_PeriphClock_InitStruct->USART3_ClockSelection = MY_RCC_GET_USART3_SOURCE();

	#endif


	#if defined(STM32F042x6) || \
		defined(STM32F048xx) || \
		defined(STM32F072xB) || \
		defined(STM32F078xx) || \
		defined(STM32F070xB) || \
		defined(STM32F070x6)

		RCC_PeriphClock_InitStruct->PeriphClockSelection |= RCC_PERIPHCLK_USB;

		/* Get the USB clock source ---------------------------------------------*/
		RCC_PeriphClock_InitStruct->USB_ClockSelection = MY_RCC_GET_USB_SOURCE();

	#endif


	#if defined(STM32F042x6) || \
		defined(STM32F048xx) || \
		defined(STM32F051x8) || \
		defined(STM32F058xx) || \
		defined(STM32F071xB) || \
		defined(STM32F072xB) || \
		defined(STM32F078xx) || \
		defined(STM32F091xC) || \
		defined(STM32F098xx)

		RCC_PeriphClock_InitStruct->PeriphClockSelection |= RCC_PERIPHCLK_CEC;

		/* Get the CEC clock source ------------------------------------------------*/
		RCC_PeriphClock_InitStruct->CEC_ClockSelection = MY_RCC_GET_CEC_SOURCE();

	#endif

