megalloid/STM32F0xx/Drivers/MY/Src/my_stm32f0xx_rcc.c
}


uint32_t MY_RCC_PeriphClock_GetFreq(uint32_t PeriphClock)
{
	/* frequency == 0 : means that no available frequency for the peripheral */
	uint32_t frequency = 0U;
	uint32_t srcclk = 0U;

	#if defined(USB)
		uint32_t pllmull = 0U, pllsource = 0U, predivfactor = 0U;
	#endif

	switch (PeriphClock)
	{
		case RCC_PERIPHCLK_RTC:
		{
			/* Get the current RTC source */
			srcclk = MY_RCC_GET_RTC_SOURCE();

			/* Check if LSE is ready and if RTC clock selection is LSE */
			if ((srcclk == RCC_RTCCLKSOURCE_LSE) && (IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)))
			{
				frequency = LSE_VALUE;
			}
			/* Check if LSI is ready and if RTC clock selection is LSI */
			else if ((srcclk == RCC_RTCCLKSOURCE_LSI) && (IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY)))
			{
				frequency = LSI_VALUE;
			}
			/* Check if HSE is ready  and if RTC clock selection is HSI_DIV32*/
			else if ((srcclk == RCC_RTCCLKSOURCE_HSE_DIV32) && (IS_BIT_SET(RCC->CR, RCC_CR_HSERDY)))
			{
				frequency = HSE_VALUE / 32U;
			}
			break;
		}
		case RCC_PERIPHCLK_USART1:
		{
			/* Get the current USART1 source */
			srcclk = MY_RCC_GET_USART1_SOURCE();

			/* Check if USART1 clock selection is PCLK1 */
			if (srcclk == RCC_USART1CLKSOURCE_PCLK1)
			{
				frequency = MY_RCC_PCLK1_GetFreq();
			}
			/* Check if HSI is ready and if USART1 clock selection is HSI */
			else if ((srcclk == RCC_USART1CLKSOURCE_HSI) && (IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)))
			{
				frequency = HSI_VALUE;
			}
			/* Check if USART1 clock selection is SYSCLK */
			else if (srcclk == RCC_USART1CLKSOURCE_SYSCLK)
			{
				frequency = MY_RCC_SysClock_GetFreq();
			}
			/* Check if LSE is ready  and if USART1 clock selection is LSE */
			else if ((srcclk == RCC_USART1CLKSOURCE_LSE) && (IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)))
			{
				frequency = LSE_VALUE;
			}
			break;
		}

		#if defined(RCC_CFGR3_USART2SW)

		case RCC_PERIPHCLK_USART2:
		{
			/* Get the current USART2 source */
			srcclk = MY_RCC_GET_USART2_SOURCE();

			/* Check if USART2 clock selection is PCLK1 */
			if (srcclk == RCC_USART2CLKSOURCE_PCLK1)
			{
				frequency = MY_RCC_PCLK1_GetFreq();
			}
			/* Check if HSI is ready and if USART2 clock selection is HSI */
			else if ((srcclk == RCC_USART2CLKSOURCE_HSI) && (IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)))
			{
				frequency = HSI_VALUE;
			}
			/* Check if USART2 clock selection is SYSCLK */
			else if (srcclk == RCC_USART2CLKSOURCE_SYSCLK)
			{
				frequency = MY_RCC_SysClock_GetFreq();
			}
			/* Check if LSE is ready  and if USART2 clock selection is LSE */
			else if ((srcclk == RCC_USART2CLKSOURCE_LSE) && (IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)))
			{
				frequency = LSE_VALUE;
			}
			break;
		}

		#endif


		#if defined(RCC_CFGR3_USART3SW)

		case RCC_PERIPHCLK_USART3:
		{
			/* Get the current USART3 source */
			srcclk = MY_RCC_GET_USART3_SOURCE();

			/* Check if USART3 clock selection is PCLK1 */
			if (srcclk == RCC_USART3CLKSOURCE_PCLK1)
			{
				frequency = MY_RCC_PCLK1_GetFreq();
			}
			/* Check if HSI is ready and if USART3 clock selection is HSI */
			else if ((srcclk == RCC_USART3CLKSOURCE_HSI) && (IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)))
			{
				frequency = HSI_VALUE;
			}
			/* Check if USART3 clock selection is SYSCLK */
			else if (srcclk == RCC_USART3CLKSOURCE_SYSCLK)
			{
				frequency = MY_RCC_SysClock_GetFreq();
			}
			/* Check if LSE is ready  and if USART3 clock selection is LSE */
			else if ((srcclk == RCC_USART3CLKSOURCE_LSE) && (IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)))
			{
				frequency = LSE_VALUE;
			}
			break;
		}

		#endif

		case RCC_PERIPHCLK_I2C1:
		{
			/* Get the current I2C1 source */
			srcclk = MY_RCC_GET_I2C1_SOURCE();

			/* Check if HSI is ready and if I2C1 clock selection is HSI */
			if ((srcclk == RCC_I2C1CLKSOURCE_HSI) && (IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)))
			{
				frequency = HSI_VALUE;
			}
			/* Check if I2C1 clock selection is SYSCLK */
			else if (srcclk == RCC_I2C1CLKSOURCE_SYSCLK)
			{
				frequency = MY_RCC_SysClock_GetFreq();
			}
			break;
		}

		#if defined(USB)

		case RCC_PERIPHCLK_USB:
		{
			/* Get the current USB source */
			srcclk = MY_RCC_GET_USB_SOURCE();

			/* Check if PLL is ready and if USB clock selection is PLL */
			if ((srcclk == RCC_USBCLKSOURCE_PLL) && (IS_BIT_SET(RCC->CR, RCC_CR_PLLRDY)))
			{
				/* Get PLL clock source and multiplication factor ----------------------*/
				pllmull      = RCC->CFGR & RCC_CFGR_PLLMUL;
				pllsource    = RCC->CFGR & RCC_CFGR_PLLSRC;
				pllmull      = (pllmull >> RCC_CFGR_PLLMUL_BITNUMBER) + 2U;
				predivfactor = (RCC->CFGR2 & RCC_CFGR2_PREDIV) + 1U;

				if (pllsource == RCC_CFGR_PLLSRC_HSE_PREDIV)
				{
					/* HSE used as PLL clock source : frequency = HSE/PREDIV * PLLMUL */
					frequency = (HSE_VALUE/predivfactor) * pllmull;
				}

				#if defined(RCC_CR2_HSI48ON)

				else if (pllsource == RCC_CFGR_PLLSRC_HSI48_PREDIV)
				{
					/* HSI48 used as PLL clock source : frequency = HSI48/PREDIV * PLLMUL */
					frequency = (HSI48_VALUE / predivfactor) * pllmull;
				}

				#endif

				else
				{
					#if defined(STM32F042x6) || \
						defined(STM32F048xx) || \
						defined(STM32F078xx) || \
						defined(STM32F072xB) || \
						defined(STM32F070xB)

						/* HSI used as PLL clock source : frequency = HSI/PREDIV * PLLMUL */
						frequency = (HSI_VALUE / predivfactor) * pllmull;

					#else

						/* HSI used as PLL clock source : frequency = HSI/2U * PLLMUL */
						frequency = (HSI_VALUE >> 1U) * pllmull;

					#endif
				}
			}

			#if defined(RCC_CR2_HSI48ON)

			/* Check if HSI48 is ready and if USB clock selection is HSI48 */
			else if ((srcclk == RCC_USBCLKSOURCE_HSI48) && (IS_BIT_SET(RCC->CR2, RCC_CR2_HSI48RDY)))
			{
				frequency = HSI48_VALUE;
			}

			#endif

			break;

		}

		#endif


		#if defined(CEC)

		case RCC_PERIPHCLK_CEC:
		{
			/* Get the current CEC source */
			srcclk = MY_RCC_GET_CEC_SOURCE();

			/* Check if HSI is ready and if CEC clock selection is HSI */
			if ((srcclk == RCC_CECCLKSOURCE_HSI) && (IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY)))
			{
				frequency = HSI_VALUE;
			}
			/* Check if LSE is ready  and if CEC clock selection is LSE */
			else if ((srcclk == RCC_CECCLKSOURCE_LSE) && (IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY)))
			{
				frequency = LSE_VALUE;
			}
			break;
		}

		#endif

		default:
		{
			break;
		}
	}

	return(frequency);

