megalloid/STM32F0xx/Drivers/MY/Src/my_stm32f0xx_rcc.c
}


uint32_t MY_RCC_SysClock_GetFreq(void)
{
	const uint8_t PLLMULFactorTable[16] = { 2U, 3U, 4U, 5U, 6U, 7U, 8U, 9U, 10U, 11U, 12U, 13U, 14U, 15U, 16U, 16U};
	const uint8_t PLLPREDIVFactorTable[16] = { 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 9U,  10U, 11U, 12U, 13U, 14U, 15U, 16U};

	uint32_t tmpreg = 0U, prediv = 0U, pllclk = 0U, pllmul = 0U;
	uint32_t sysclockfreq = 0U;

	tmpreg = RCC->CFGR;

	/* Get SYSCLK source -------------------------------------------------------*/
	switch (tmpreg & RCC_CFGR_SWS)
	{
		case RCC_SYSCLKSOURCE_STATUS_HSE:  /* HSE used as system clock */
		{
			sysclockfreq = HSE_VALUE;
			break;
		}
		case RCC_SYSCLKSOURCE_STATUS_PLLCLK:  /* PLL used as system clock */
		{
			pllmul = PLLMULFactorTable[(uint32_t)(tmpreg & RCC_CFGR_PLLMUL) >> RCC_CFGR_PLLMUL_BITNUMBER];
			prediv = PLLPREDIVFactorTable[(uint32_t)(RCC->CFGR2 & RCC_CFGR2_PREDIV) >> RCC_CFGR2_PREDIV_BITNUMBER];

			if ((tmpreg & RCC_CFGR_PLLSRC) == RCC_PLLSOURCE_HSE)
			{
				/* HSE used as PLL clock source : PLLCLK = HSE/PREDIV * PLLMUL */
				pllclk = (HSE_VALUE / prediv) * pllmul;
			}

			#if defined(RCC_CFGR_PLLSRC_HSI48_PREDIV)

			else if ((tmpreg & RCC_CFGR_PLLSRC) == RCC_PLLSOURCE_HSI48)
			{
				/* HSI48 used as PLL clock source : PLLCLK = HSI48/PREDIV * PLLMUL */
				pllclk = (HSI48_VALUE / prediv) * pllmul;
			}

			#endif

			else
			{

				#if defined(STM32F042x6) || \
					defined(STM32F048xx) || \
					defined(STM32F070x6) || \
					defined(STM32F071xB) || \
					defined(STM32F072xB) || \
					defined(STM32F078xx) || \
					defined(STM32F070xB) || \
					defined(STM32F091xC) || \
					defined(STM32F098xx) || \
					defined(STM32F030xC)

					/* HSI used as PLL clock source : PLLCLK = HSI/PREDIV * PLLMUL */
					pllclk = (HSI_VALUE / prediv) * pllmul;

				#else

					/* HSI used as PLL clock source : PLLCLK = HSI/2 * PLLMUL */
					pllclk = (uint32_t)((HSI_VALUE >> 1U) * pllmul);

				#endif

			}

			sysclockfreq = pllclk;

			break;
		}


		#if defined(RCC_CFGR_SWS_HSI48)

		case RCC_SYSCLKSOURCE_STATUS_HSI48:    /* HSI48 used as system clock source */
		{
			sysclockfreq = HSI48_VALUE;
			break;
		}

		#endif


		case RCC_SYSCLKSOURCE_STATUS_HSI:  /* HSI used as system clock source */


		default: /* HSI used as system clock */
		{
			sysclockfreq = HSI_VALUE;
			break;
		}
	}

	return sysclockfreq;
}


uint32_t MY_RCC_HCLK_GetFreq(void)
{
	return SystemCoreClock;
}


uint32_t MY_RCC_PCLK1_GetFreq(void)
{
	/* Get HCLK source and Compute PCLK1 frequency */
	return (MY_RCC_HCLK_GetFreq() >> APBPrescTable[(RCC->CFGR & RCC_CFGR_PPRE) >> RCC_CFGR_PPRE_BITNUMBER]);
}


void MY_RCC_Osc_GetConfig(MY_RCC_Osc_Init_t  *RCC_Osc_InitStruct)
{
	/* Set all possible values for the Oscillator type parameter ---------------*/
	RCC_Osc_InitStruct->OscillatorType = 	RCC_OSCILLATORTYPE_HSE | \
											RCC_OSCILLATORTYPE_HSI | \
											RCC_OSCILLATORTYPE_LSE | \
											RCC_OSCILLATORTYPE_LSI | \
											RCC_OSCILLATORTYPE_HSI14;
	#if defined(RCC_HSI48_SUPPORT)

	RCC_OscInitStruct->OscillatorType |= RCC_OSCILLATORTYPE_HSI48;

	#endif


	/* Get the HSE configuration -----------------------------------------------*/
	if((RCC->CR & RCC_CR_HSEBYP) == RCC_CR_HSEBYP)
	{
		RCC_Osc_InitStruct->HSE_State = RCC_HSE_BYPASS;
	}
	else if((RCC->CR &RCC_CR_HSEON) == RCC_CR_HSEON)
	{
		RCC_Osc_InitStruct->HSE_State = RCC_HSE_ON;
	}
	else
	{
		RCC_Osc_InitStruct->HSE_State = RCC_HSE_OFF;
	}


	/* Get the HSI configuration -----------------------------------------------*/
	if((RCC->CR & RCC_CR_HSION) == RCC_CR_HSION)
	{
		RCC_Osc_InitStruct->HSI_State = RCC_HSI_ON;
	}
	else
	{
		RCC_Osc_InitStruct->HSI_State = RCC_HSI_OFF;
	}

	RCC_Osc_InitStruct->HSI_CalibrationValue = (uint32_t)((RCC->CR &RCC_CR_HSITRIM) >> RCC_CR_HSITRIM_BITNUMBER);


	/* Get the LSE configuration -----------------------------------------------*/
	if((RCC->BDCR &RCC_BDCR_LSEBYP) == RCC_BDCR_LSEBYP)
	{
		RCC_Osc_InitStruct->LSE_State = RCC_LSE_BYPASS;
	}
	else if((RCC->BDCR &RCC_BDCR_LSEON) == RCC_BDCR_LSEON)
	{
		RCC_Osc_InitStruct->LSE_State = RCC_LSE_ON;
	}
	else
	{
		RCC_Osc_InitStruct->LSE_State = RCC_LSE_OFF;
	}


	/* Get the LSI configuration -----------------------------------------------*/
	if((RCC->CSR &RCC_CSR_LSION) == RCC_CSR_LSION)
	{
		RCC_Osc_InitStruct->LSI_State = RCC_LSI_ON;
	}
	else
	{
		RCC_Osc_InitStruct->LSI_State = RCC_LSI_OFF;
	}


	/* Get the HSI14 configuration -----------------------------------------------*/
	if((RCC->CR2 & RCC_CR2_HSI14ON) == RCC_CR2_HSI14ON)
	{
		RCC_Osc_InitStruct->HSI14_State = RCC_HSI_ON;
	}
	else
	{
		RCC_Osc_InitStruct->HSI14_State = RCC_HSI_OFF;
	}


	RCC_Osc_InitStruct->HSI14_CalibrationValue = (uint32_t)((RCC->CR2 & RCC_CR2_HSI14TRIM) >> RCC_HSI14TRIM_BITNUMBER);


	#if defined(RCC_HSI48_SUPPORT)

	/* Get the HSI48 configuration if any-----------------------------------------*/
	RCC_Osc_InitStruct->HSI48_State = MY_RCC_GET_HSI48_STATE();

	#endif /* RCC_HSI48_SUPPORT */


	/* Get the PLL configuration -----------------------------------------------*/
	if((RCC->CR &RCC_CR_PLLON) == RCC_CR_PLLON)
	{
		RCC_Osc_InitStruct->PLL.PLL_State = RCC_PLL_ON;
	}
	else
	{
		RCC_Osc_InitStruct->PLL.PLL_State = RCC_PLL_OFF;
	}

	RCC_Osc_InitStruct->PLL.PLL_Source = (uint32_t)(RCC->CFGR & RCC_CFGR_PLLSRC);
	RCC_Osc_InitStruct->PLL.PLL_MUL = (uint32_t)(RCC->CFGR & RCC_CFGR_PLLMUL);
	RCC_Osc_InitStruct->PLL.PLL_PREDIV = (uint32_t)(RCC->CFGR2 & RCC_CFGR2_PREDIV);

}


void MY_RCC_Clock_GetConfig(MY_RCC_Clock_Init_t  *RCC_Clock_InitStruct, uint32_t *pFlashLatency)
{
	/* Set all possible values for the Clock type parameter --------------------*/
	RCC_Clock_InitStruct->ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1;

	/* Get the SYSCLK configuration --------------------------------------------*/
	RCC_Clock_InitStruct->SYSCLK_Source = (uint32_t)(RCC->CFGR & RCC_CFGR_SW);

	/* Get the HCLK configuration ----------------------------------------------*/
	RCC_Clock_InitStruct->AHBCLK_Divider = (uint32_t)(RCC->CFGR & RCC_CFGR_HPRE);

	/* Get the APB1 configuration ----------------------------------------------*/
	RCC_Clock_InitStruct->APB1CLK_Divider = (uint32_t)(RCC->CFGR & RCC_CFGR_PPRE);

	/* Get the Flash Wait State (Latency) configuration ------------------------*/
	*pFlashLatency = (uint32_t)(FLASH->ACR & FLASH_ACR_LATENCY);
}


