megalloid/STM32F0xx/Drivers/MY/Src/my_stm32f0xx_rcc.c
void MY_RCC_MCO_Config(uint32_t RCC_MCO_Source, uint32_t RCC_MCO_Div)
{
	/* Инициализация пина GPIO */
	MY_GPIO_Init_t		 MCO_GPIO;

	MCO_GPIO.Mode      = GPIO_MODE_AF_PP;
	MCO_GPIO.Speed     = GPIO_SPEED_FREQ_HIGH;
	MCO_GPIO.Pull      = GPIO_NOPULL;
	MCO_GPIO.Pin       = MCO1_PIN;
	MCO_GPIO.Alternate = GPIO_AF0_MCO;

	MY_GPIO_StructInit(MCO1_GPIO_PORT, &MCO_GPIO);

	/* Настройка MCO */
	MY_RCC_MCO_CONFIG(RCC_MCO_Source, RCC_MCO_Div);
}


void MY_RCC_CSS_Enable(void)
{
	SET_BIT(RCC->CR, RCC_CR_CSSON);
}


void MY_RCC_CSS_Disable(void)
{
	CLEAR_BIT(RCC->CR, RCC_CR_CSSON);
}


#if defined(STM32F042x6) || \
	defined(STM32F048xx) || \
	defined(STM32F071xB) || \
	defined(STM32F072xB) || \
	defined(STM32F078xx) || \
	defined(STM32F091xC) || \
	defined(STM32F098xx)

void MY_RCC_CRS_Config(MY_RCC_CRS_Init_t *pInit)
{
	uint32_t value = 0U;

	/* CONFIGURATION */

	/* Before configuration, reset CRS registers to their default values*/
	MY_RCC_CRS_FORCE_RESET();
	MY_RCC_CRS_RELEASE_RESET();

	/* Set the SYNCDIV[2:0] bits according to Prescaler value */
	/* Set the SYNCSRC[1:0] bits according to Source value */
	/* Set the SYNCSPOL bit according to Polarity value */
	value = (pInit->Prescaler | pInit->Source | pInit->Polarity);

	/* Set the RELOAD[15:0] bits according to ReloadValue value */
	value |= pInit->ReloadValue;

	/* Set the FELIM[7:0] bits according to ErrorLimitValue value */
	value |= (pInit->ErrorLimitValue << CRS_CFGR_FELIM_BITNUMBER);

	WRITE_REG(CRS->CFGR, value);

	/* Adjust HSI48 oscillator smooth trimming */
	/* Set the TRIM[5:0] bits according to RCC_CRS_HSI48CalibrationValue value */
	MODIFY_REG(CRS->CR, CRS_CR_TRIM, (pInit->HSI48_CalibrationValue << CRS_CR_TRIM_BITNUMBER));

	/* START AUTOMATIC SYNCHRONIZATION*/

	/* Enable Automatic trimming & Frequency error counter */
	SET_BIT(CRS->CR, CRS_CR_AUTOTRIMEN | CRS_CR_CEN);
}


void MY_RCC_CRS_SoftwareSyncGenerate(void)
{
	SET_BIT(CRS->CR, CRS_CR_SWSYNC);
}


void MY_RCC_CRS_GetSyncInfo(RCC_CRS_Sync_Info_t *pSyncInfo)
{
	/* Get the reload value */
	pSyncInfo->ReloadValue = (uint32_t)(READ_BIT(CRS->CFGR, CRS_CFGR_RELOAD));

	/* Get HSI48 oscillator smooth trimming */
	pSyncInfo->HSI48CalibrationValue = (uint32_t)(READ_BIT(CRS->CR, CRS_CR_TRIM) >> CRS_CR_TRIM_BITNUMBER);

	/* Get Frequency error capture */
	pSyncInfo->FreqErrorCapture = (uint32_t)(READ_BIT(CRS->ISR, CRS_ISR_FECAP) >> CRS_ISR_FECAP_BITNUMBER);

	/* Get Frequency error direction */
	pSyncInfo->FreqErrorDirection = (uint32_t)(READ_BIT(CRS->ISR, CRS_ISR_FEDIR));
}


uint32_t MY_RCC_CRS_WaitSync(uint32_t Timeout)
{
	uint32_t crsstatus = RCC_CRS_NONE;
	uint32_t tickstart = 0U;

	/* Get timeout */
	tickstart = MY_SysTick_GetTick();

	/* Wait for CRS flag or timeout detection */
	do
	{
		if(Timeout != MAX_DELAY)
		{
			if((Timeout == 0U) || ((MY_SysTick_GetTick() - tickstart) > Timeout))
			{
				crsstatus = RCC_CRS_TIMEOUT;
			}
		}


		/* Check CRS SYNCOK flag  */
		if(MY_RCC_CRS_GET_FLAG(RCC_CRS_FLAG_SYNCOK))
		{
			/* CRS SYNC event OK */
			crsstatus |= RCC_CRS_SYNCOK;

			/* Clear CRS SYNC event OK bit */
			MY_RCC_CRS_CLEAR_FLAG(RCC_CRS_FLAG_SYNCOK);
		}


		/* Check CRS SYNCWARN flag  */
		if(MY_RCC_CRS_GET_FLAG(RCC_CRS_FLAG_SYNCWARN))
		{
			/* CRS SYNC warning */
			crsstatus |= RCC_CRS_SYNCWARN;

			/* Clear CRS SYNCWARN bit */
			MY_RCC_CRS_CLEAR_FLAG(RCC_CRS_FLAG_SYNCWARN);
		}


		/* Check CRS TRIM overflow flag  */
		if(MY_RCC_CRS_GET_FLAG(RCC_CRS_FLAG_TRIMOVF))
		{
			/* CRS SYNC Error */
			crsstatus |= RCC_CRS_TRIMOVF;

			/* Clear CRS Error bit */
			MY_RCC_CRS_CLEAR_FLAG(RCC_CRS_FLAG_TRIMOVF);
		}


		/* Check CRS Error flag  */
		if(MY_RCC_CRS_GET_FLAG(RCC_CRS_FLAG_SYNCERR))
		{
			/* CRS SYNC Error */
			crsstatus |= RCC_CRS_SYNCERR;

			/* Clear CRS Error bit */
			MY_RCC_CRS_CLEAR_FLAG(RCC_CRS_FLAG_SYNCERR);
		}


		/* Check CRS SYNC Missed flag  */
		if(MY_RCC_CRS_GET_FLAG(RCC_CRS_FLAG_SYNCMISS))
		{
			/* CRS SYNC Missed */
			crsstatus |= RCC_CRS_SYNCMISS;

			/* Clear CRS SYNC Missed bit */
			MY_RCC_CRS_CLEAR_FLAG(RCC_CRS_FLAG_SYNCMISS);
		}


		/* Check CRS Expected SYNC flag  */
		if(MY_RCC_CRS_GET_FLAG(RCC_CRS_FLAG_ESYNC))
		{
			/* frequency error counter reached a zero value */
			MY_RCC_CRS_CLEAR_FLAG(RCC_CRS_FLAG_ESYNC);
		}
	}
	while(RCC_CRS_NONE == crsstatus);

	return crsstatus;
}


void MY_RCC_CRS_IRQHandler(void)
{
	uint32_t crserror = RCC_CRS_NONE;

	/* Get current IT flags and IT sources values */
	uint32_t itflags = READ_REG(CRS->ISR);
	uint32_t itsources = READ_REG(CRS->CR);

	/* Check CRS SYNCOK flag  */
	if(((itflags & RCC_CRS_FLAG_SYNCOK) != RESET) && ((itsources & RCC_CRS_IT_SYNCOK) != RESET))
	{
		/* Clear CRS SYNC event OK flag */
		WRITE_REG(CRS->ICR, CRS_ICR_SYNCOKC);

		/* user callback */
		MY_RCC_CRS_SyncOkCallback();
	}
	/* Check CRS SYNCWARN flag  */
	else if(((itflags & RCC_CRS_FLAG_SYNCWARN) != RESET) && ((itsources & RCC_CRS_IT_SYNCWARN) != RESET))
	{
		/* Clear CRS SYNCWARN flag */
		WRITE_REG(CRS->ICR, CRS_ICR_SYNCWARNC);

		/* user callback */
		MY_RCC_CRS_SyncWarnCallback();
	}
	/* Check CRS Expected SYNC flag  */
	else if(((itflags & RCC_CRS_FLAG_ESYNC) != RESET) && ((itsources & RCC_CRS_IT_ESYNC) != RESET))
	{
		/* frequency error counter reached a zero value */
		WRITE_REG(CRS->ICR, CRS_ICR_ESYNCC);

		/* user callback */
		MY_RCC_CRS_ExpectedSyncCallback();
	}
	/* Check CRS Error flags  */
	else
	{
		if(((itflags & RCC_CRS_FLAG_ERR) != RESET) && ((itsources & RCC_CRS_IT_ERR) != RESET))
		{
			if((itflags & RCC_CRS_FLAG_SYNCERR) != RESET)
			{
				crserror |= RCC_CRS_SYNCERR;
			}

			if((itflags & RCC_CRS_FLAG_SYNCMISS) != RESET)
			{
				crserror |= RCC_CRS_SYNCMISS;
			}

			if((itflags & RCC_CRS_FLAG_TRIMOVF) != RESET)
			{
				crserror |= RCC_CRS_TRIMOVF;
			}

			/* Clear CRS Error flags */
			WRITE_REG(CRS->ICR, CRS_ICR_ERRC);

			/* user error callback */
			MY_RCC_CRS_ErrorCallback(crserror);
		}
	}
}


_weak void MY_RCC_CRS_SyncOkCallback(void)
{
	/* NOTE : This function should not be modified, when the callback is needed, the @ref MY_RCC_CRS_SyncOkCallback should be implemented in the user file */
}


__weak void MY_RCC_CRS_SyncWarnCallback(void)
{
	/* NOTE : This function should not be modified, when the callback is needed, the @ref MY_RCC_CRS_SyncWarnCallback should be implemented in the user file */
}


__weak void MY_RCC_CRS_ExpectedSyncCallback(void)
{
	/* NOTE : This function should not be modified, when the callback is needed, the @ref MY_RCC_CRS_ExpectedSyncCallback should be implemented in the user file */
}


__weak void MY_RCC_CRS_ErrorCallback(uint32_t Error)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(Error);

	/* NOTE : This function should not be modified, when the callback is needed, the @ref MY_RCC_CRS_ErrorCallback should be implemented in the user file */
}

#endif
